Catalogs/AMQP_СправочникиЗагрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>AMQP_СправочникиЗагрузки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяСправочника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Загружать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РодительЗагрузки</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучноеРедактирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/AMQP_РаботаСоСправочниками/Ext/Module.bsl
//ПРОЦЕДУРЫ ПОДПИСОК НА СОБЫТИЯ
Процедура AMQP_ПередЗаписьюСправочникаПередЗаписью(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Константы.AMQP_ИспользоватьЗагрузкуСправочниковИзМДМ.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ДополнительныеСвойства.Свойство("ПропуститьПроверкуAMQP") Тогда
		Возврат;
	КонецЕсли;
	
	ИмяСправочника = Источник.Метаданные().Имя;
	
	СправочникЗагрузки = Справочники.AMQP_СправочникиЗагрузки.НайтиПоРеквизиту("ИмяСправочника", ИмяСправочника);
	
	Если ЗначениеЗаполнено(СправочникЗагрузки) И СправочникЗагрузки.Загружать И НЕ СправочникЗагрузки.РучноеРедактирование Тогда
		
		Если Константы.РазрешитьРедактированиеНесинхронизированныхЭлементов.Получить() и Не ЗначениеЗаполнено(Источник.КодМДМ) тогда
			Возврат
		КонецЕсли;
		
		Если Константы.РазрешитьИзменениеНоменклатурыПослеОбменаcMDM.Получить() и (ИмяСправочника = "Номенклатура" ИЛИ ИмяСправочника = "ЕдиницыИзмерения") Тогда
			Возврат;
		КонецЕсли;    
		
		Сообщить("Этот справочник синхронизируется через систему МДМ" + Символы.ПС + "Запрещено ручное редактирование!");
		Отказ = Истина;
		
	КонецЕсли;    	
	
	Если ИмяСправочника = "Номенклатура" И Источник.ЭтоГруппа = Истина Тогда
		
		СправочникЗагрузки = Справочники.AMQP_СправочникиЗагрузки.НайтиПоРеквизиту("ИмяСправочника", "Производители");
			
		Если ЗначениеЗаполнено(СправочникЗагрузки) И СправочникЗагрузки.Загружать И НЕ СправочникЗагрузки.РучноеРедактирование Тогда
			
			Сообщить("Запрещено создание группы номенклатуры в справочнике ""Номенклатуры""." + Символы.ПС 
					 + "Для создания группы, нужно воспользоваться справочником ""Производители"" в МДМ !!!! ");
			Отказ = Истина;	
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры


//ДОПОЛНИТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ МОДУЛЯ
Функция ОтправитьСообщениеВЭластик(СтруктураСообщения, НомерСообщения, ЗаписыватьВЖурналОшибку = Ложь, КатегорияЖурналаРегистрации = "ПолучениеСообщений.Ошибка") Экспорт	
	
	Оповещен = Истина;
	
	Возврат Оповещен;

КонецФункции

Функция ВернутьJSON(Структура)
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Структура);
	JsonСтрока = ЗаписьJSON.Закрыть();  	
	
	Возврат JsonСтрока;
	
КонецФункции
